china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_uart.c
    tg_UART_Reg[port]->CR3 |= 0x00c0;  //设置串口使用DMA收发
    s_UART_DmaUsed[port] = CN_DMA_USED;

    Int_Register(UartDmaTxInt[port]);  //注册发送DMA中断
    Int_Register(UartDmaRxInt[port]);  //注册接收DMA中断

    Int_SetClearType(UartDmaRxInt[port],CN_INT_CLEAR_AUTO);  //关联中断
    Int_SetClearType(UartDmaTxInt[port],CN_INT_CLEAR_AUTO);

    if(UART_Mode[port] == CN_UART_GENERAL)
    {
        Int_IsrConnect(UartDmaRxInt[port],UART_DmaRx_ISR);
        Int_IsrConnect(UartDmaTxInt[port],UART_DmaTx_ISR);
    }
    else
    {
        Int_IsrConnect(UartDmaRxInt[port],UART_Poll_DmaRx_ISR);
        Int_IsrConnect(UartDmaTxInt[port],UART_Poll_DmaTx_ISR);
    }

    Int_SettoAsynSignal(UartDmaRxInt[port]);
    Int_SettoAsynSignal(UartDmaTxInt[port]);

//    Int_SettoReal(UartDmaRxInt[port]);
//    Int_SettoReal(UartDmaTxInt[port]);

    Int_SetIsrPara(UartDmaRxInt[port],port);
    Int_SetIsrPara(UartDmaTxInt[port],port);

    Int_RestoreAsynLine(UartDmaRxInt[port]);
    Int_RestoreAsynLine(UartDmaTxInt[port]);

    Int_ClearLine(UartDmaTxInt[port]);
    Int_ClearLine(UartDmaRxInt[port]);

    DMA_Enable(UartDmaRxChannel[port],(u32)DmaRecvBuf,DmaBufLen);  //开启DMA传输
    return ;

    exit_from_Rcvbuf2:
        free(pUartPollCB[port]);
    exit_from_Poll:
        free(pUART_DmaSendBuf[port]);
        pUART_DmaSendBuf[port]=NULL;
    exit_from_Sendbuf:
        free(pUART_DmaRecvBuf[port]);
        pUART_DmaRecvBuf[port]=NULL;
    exit_from_Rcvbuf:
        return;
}

//=============================================================================
// 功能: 设置不使用DMA，UART不使用DMA收发，每收发一个字节就必须中断一次，不建议在高速
//      连续通信中使用。
// 参数: port,端口号，即串口号，为1~3
// 返回: 无
// =============================================================================
void __UART_SetDmaUnUsed(u32 port)
{
    u8 IntLine;
    if(port == CN_UART1)             IntLine = CN_INT_LINE_USART1;
    else if(port == CN_UART2)        IntLine = CN_INT_LINE_USART2;
    else if(port == CN_UART3)        IntLine = CN_INT_LINE_USART3;
    else if(port == CN_UART4)        IntLine = CN_INT_LINE_UART4;
    else if(port == CN_UART5)        IntLine = CN_INT_LINE_UART5;
    else
    return;

    free(pUART_DmaRecvBuf[port]);
    pUART_DmaRecvBuf[port]=NULL;
    free(pUART_DmaSendBuf[port]);
    pUART_DmaSendBuf[port]=NULL;

    tg_UART_Reg[port]->CR3 &= ~0x00c0;  //设置不使用dma传输
    Int_RestoreAsynLine(IntLine);
    if(s_UART_DmaUsed[port] == CN_DMA_USED)
    {
        Int_SaveAsynLine(UartDmaRxInt[port]);
        Int_SaveAsynLine(UartDmaTxInt[port]);
        s_UART_DmaUsed[port] = CN_DMA_UNUSED;
    }
    __UART_RxIntEnable(CN_DMA_UNUSED,port);
    __UART_TxIntEnable(CN_DMA_UNUSED,port);
    tg_UART_Reg[port]->CR1 &= ~(1<<4); //disable idle int
}
// =============================================================================
// 功能: 串口设备的控制函数,与具体的硬件寄存器设置相关
// 参数: Reg,被操作的串口寄存器指针.
//       cmd,操作类型
//       data1,data2,含义依cmd而定
// 返回: 无意义.
// =============================================================================
u32 CN1=0,CN2=0,CN3=0,CN4=0,CN5=0;
static ptu32_t __UART_Ctrl(tagUartReg *Reg,u32 cmd, u32 data1,u32 data2)
{
    ptu32_t result = 0;
    u32 port;
    u32 len,len1,len2,len3;
    if(Reg == NULL)
        return 0;

    switch((u32)Reg)
    {
        case CN_UART1_BASE: port = CN_UART1;break;
        case CN_UART2_BASE: port = CN_UART2;break;
        case CN_UART3_BASE: port = CN_UART3;break;
        case CN_UART4_BASE: port = CN_UART4;break;
        case CN_UART5_BASE: port = CN_UART5;break;
        default:return 0;
    }

    switch(cmd)
    {
        case CN_UART_START:
            __UART_Enable(port);
            break;
        case CN_UART_STOP:
            __UART_Disable(port);
            break;
        case CN_UART_SET_BAUD:  //设置Baud
             __UART_BaudSet(Reg,port, data1);
            break;
        case CN_UART_EN_RTS:
            Reg->CR3 |= 0x100;
            break;
        case CN_UART_DIS_RTS:
            Reg->CR3 &= ~0x100;
            break;
        case CN_UART_EN_CTS:
            Reg->CR3 |= 0x200;
            break;
        case CN_UART_DIS_CTS:
            Reg->CR3 &= ~0x200;
            break;
        case CN_UART_DMA_USED:
            __UART_SetDmaUsed(port);
            break;
        case CN_UART_DMA_UNUSED:
            __UART_SetDmaUnUsed(port);
            break;
        case CN_UART_COM_SET:
            __UART_ComConfig(Reg,port,data1);
            break;
        case CN_UART_SEND_BUF:
            Board_UartHalfDuplexSend(port);
            DMA_Enable(UartDmaTxChannel[port],(u32)data1,data2);
            result = data2;
            break;
        case CN_UART_RECV_BUF:
          switch (pUartPollCB[port]->NoCopyBufNum)
          {
            case 1:
                switch (pUartPollCB[port]->NowRecvbuf)
                {
                   case 0:memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[4],data2);
                          break;
                   case 1:memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[0],data2);
                          break;
                   case 2:memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[1],data2);
                          break;
                   case 3:memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[2],data2);
                          break;
                   case 4:memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[3],data2);
                          break;
                   default:  break;
                }
                CN1++;
                break;
            case 2:
                switch (pUartPollCB[port]->NowRecvbuf)
                {
                   case 0: len = MIN(data2,pUartPollCB[port]->RcvBufLen[3]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[3],len);
                           memcpy((u8*)(data1+pUartPollCB[port]->RcvBufLen[3]),pUartPollCB[port]->DmaRecvBuf[4],data2-len);
                           break;
                   case 1: len = MIN(data2,pUartPollCB[port]->RcvBufLen[4]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[4],len);
                           memcpy((u8*)(data1+pUartPollCB[port]->RcvBufLen[4]),pUartPollCB[port]->DmaRecvBuf[0],data2-len);
                           break;
                   case 2: len = MIN(data2,pUartPollCB[port]->RcvBufLen[0]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[0],len);
                           memcpy((u8*)(data1+pUartPollCB[port]->RcvBufLen[0]),pUartPollCB[port]->DmaRecvBuf[1],data2-len);
                           break;
                   case 3: len = MIN(data2,pUartPollCB[port]->RcvBufLen[1]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[1],len);
                           memcpy((u8*)(data1+pUartPollCB[port]->RcvBufLen[1]),pUartPollCB[port]->DmaRecvBuf[2],data2-len);
                           break;
                   case 4: len = MIN(data2,pUartPollCB[port]->RcvBufLen[2]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[2],len);
                           memcpy((u8*)(data1+pUartPollCB[port]->RcvBufLen[2]),pUartPollCB[port]->DmaRecvBuf[3],data2-len);
                           break;
                   default:  break;
                }
                CN2++;
                break;
            case 3:
                switch (pUartPollCB[port]->NowRecvbuf)
                {
                   case 0: len = MIN(data2,pUartPollCB[port]->RcvBufLen[2]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[3]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[2],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[3],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[4],data2-len-len1);
                           break;
                   case 1: len = MIN(data2,pUartPollCB[port]->RcvBufLen[3]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[4]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[3],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[4],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[0],data2-len-len1);
                           break;
                   case 2: len = MIN(data2,pUartPollCB[port]->RcvBufLen[4]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[0]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[4],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[0],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[1],data2-len-len1);
                           break;
                   case 3: len = MIN(data2,pUartPollCB[port]->RcvBufLen[0]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[1]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[0],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[1],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[2],data2-len-len1);
                           break;
                   case 4: len = MIN(data2,pUartPollCB[port]->RcvBufLen[1]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[2]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[1],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[2],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[3],data2-len-len1);
                           break;
                   default:  break;
                }
                CN3++;
                break;
            case 4:
                switch (pUartPollCB[port]->NowRecvbuf)
                {
                   case 0: len = MIN(data2,pUartPollCB[port]->RcvBufLen[1]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[2]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[3]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[1],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[2],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[3],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[4],data2-len-len1-len2);
                           break;
                   case 1: len = MIN(data2,pUartPollCB[port]->RcvBufLen[2]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[3]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[4]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[2],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[3],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[4],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[0],data2-len-len1-len2);
                           break;
                   case 2: len = MIN(data2,pUartPollCB[port]->RcvBufLen[3]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[4]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[0]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[3],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[4],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[0],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[1],data2-len-len1-len2);
                           break;
                   case 3: len = MIN(data2,pUartPollCB[port]->RcvBufLen[4]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[0]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[1]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[4],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[0],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[1],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[2],data2-len-len1-len2);
                           break;
                   case 4: len = MIN(data2,pUartPollCB[port]->RcvBufLen[0]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[1]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[2]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[0],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[1],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[2],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[3],data2-len-len1-len2);
                           break;
                   default:  break;
                }
                CN4++;
                break;
            case 5:
                switch (pUartPollCB[port]->NowRecvbuf)
                {
                   case 0: len = MIN(data2,pUartPollCB[port]->RcvBufLen[0]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[1]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[2]);
                           len3 = MIN(data2-len-len1-len2,pUartPollCB[port]->RcvBufLen[3]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[0],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[1],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[2],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[3],len3);
                           memcpy((u8*)(data1+len+len1+len2+len3),pUartPollCB[port]->DmaRecvBuf[4],data2-len-len1-len2-len3);
                           break;
                   case 1: len = MIN(data2,pUartPollCB[port]->RcvBufLen[1]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[2]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[3]);
                           len3 = MIN(data2-len-len1-len2,pUartPollCB[port]->RcvBufLen[4]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[1],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[2],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[3],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[4],len3);
                           memcpy((u8*)(data1+len+len1+len2+len3),pUartPollCB[port]->DmaRecvBuf[0],data2-len-len1-len2-len3);
                           break;
                   case 2: len = MIN(data2,pUartPollCB[port]->RcvBufLen[2]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[3]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[4]);
                           len3 = MIN(data2-len-len1-len2,pUartPollCB[port]->RcvBufLen[0]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[2],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[3],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[4],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[0],len3);
                           memcpy((u8*)(data1+len+len1+len2+len3),pUartPollCB[port]->DmaRecvBuf[1],data2-len-len1-len2-len3);
                           break;
                   case 3: len = MIN(data2,pUartPollCB[port]->RcvBufLen[3]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[4]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[0]);
                           len3 = MIN(data2-len-len1-len2,pUartPollCB[port]->RcvBufLen[1]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[3],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[4],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[0],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[1],len3);
                           memcpy((u8*)(data1+len+len1+len2+len3),pUartPollCB[port]->DmaRecvBuf[2],data2-len-len1-len2-len3);
                           break;
                   case 4: len = MIN(data2,pUartPollCB[port]->RcvBufLen[4]);
                           len1 = MIN(data2-len,pUartPollCB[port]->RcvBufLen[0]);
                           len2 = MIN(data2-len-len1,pUartPollCB[port]->RcvBufLen[1]);
                           len3 = MIN(data2-len-len1-len2,pUartPollCB[port]->RcvBufLen[2]);
                           memcpy((u8*)data1,pUartPollCB[port]->DmaRecvBuf[4],len);
                           memcpy((u8*)(data1+len),pUartPollCB[port]->DmaRecvBuf[0],len1);
                           memcpy((u8*)(data1+len+len1),pUartPollCB[port]->DmaRecvBuf[1],len2);
                           memcpy((u8*)(data1+len+len1+len2),pUartPollCB[port]->DmaRecvBuf[2],len3);
                           memcpy((u8*)(data1+len+len1+len2+len3),pUartPollCB[port]->DmaRecvBuf[3],data2-len-len1-len2-len3);
                           break;
                   default:  break;
                }
                CN5++;
                break;
                default:	break;
			}
            pUartPollCB[port]->NoCopyBufNum = 0;  //清0
//            pUartPollCB[port]->RcvBufLen[0] = 0;
//            pUartPollCB[port]->RcvBufLen[1] = 0;
            break;
        default: break;
    }
    return result;
}

