china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_uart.c
// =============================================================================
// 功能: 当uart2配置成dma方式是，dma1 ch7负责发送，ch6负责接收
// 参数: 中断函数没有参数.
// 返回: 中断函数没有返回值.
// =============================================================================
uint32_t UART_DmaTx_ISR(ptu32_t port)
{
    uint16_t num;
    u8 *DmaSendBuf;
    u32 DmaSendBufLen;

    switch(port)
    {
    case CN_UART1:
        DmaSendBufLen = UART1_DmaBufLen;        break;
    case CN_UART2:
        DmaSendBufLen = UART2_DmaBufLen;        break;
    case CN_UART3:
        DmaSendBufLen = UART3_DmaBufLen;        break;
    case CN_UART4:
        DmaSendBufLen = UART4_DmaBufLen;        break;
    case CN_UART5:
        DmaSendBufLen = UART5_DmaBufLen;        break;
    default:        break;
    }

    DmaSendBuf = pUART_DmaSendBuf[port];
    DMA_ClearIntFlag(UartDmaTxChannel[port]);
    num = UART_PortRead(pUartCB[port],DmaSendBuf,DmaSendBufLen,0);
    if(num == 0)
    {
        s_UART_DmaSending[port] = false;
        tg_UART_Reg[port]->CR1 |= (1<<6);
    }
    else
    {
        DMA_Enable(UartDmaTxChannel[port],(u32)DmaSendBuf,num);
    }
    return 0;
}
// =============================================================================
// 功能: 当uart2配置成dma方式是，dma1 ch7负责发送，ch6负责接收
// 参数: 中断函数没有参数.
// 返回: 中断函数没有返回值.
// =============================================================================
uint32_t UART_Poll_DmaTx_ISR(ptu32_t port)
{

    DMA_ClearIntFlag(UartDmaTxChannel[port]);
    s_UART_DmaSending[port] = false;
    UART_Poll_PortRead(pUartCB[port]);
    //todo:为了提高切换的速度这里不判断TC中断完成
    //进IDLE中断的时间可满足4M波特率一个字节
    Board_UartHalfDuplexRecv(port);
    return 0;
}
// =============================================================================
// 功能: CN_UART_POLL模式下DMA接收中断处理函数
//      接收中断有两个缓冲区采用乒乓缓存的模式
// 参数:
// 返回:
// =============================================================================
uint32_t UART_Poll_DmaRx_ISR(ptu32_t port)
{
    u32 recvs,num,DmaRecvBufLen;
    DMA_Channel_TypeDef *DMA_Channelx;
    u8 channelx;
    u32 ifcr;
    DMA_TypeDef *DMAx;
    u8 RcvBufNum;
    switch(port)
    {
    case CN_UART1:
        DmaRecvBufLen = UART1_DmaBufLen;        break;
    case CN_UART2:
        DmaRecvBufLen = UART2_DmaBufLen;        break;
    case CN_UART3:
        DmaRecvBufLen = UART3_DmaBufLen;        break;
    case CN_UART4:
        DmaRecvBufLen = UART4_DmaBufLen;        break;
    case CN_UART5:
        DmaRecvBufLen = UART5_DmaBufLen;        break;
    default:        break;
    }

    DMA_Channelx = UartDmaRxChannel[port];
    if((u32)DMA_Channelx>(u32)DMA2)   //得到当前stream是属于DMA2还是DMA1
        DMAx=DMA2;
    else
        DMAx=DMA1;
    channelx=((((u32)DMA_Channelx-(u32)DMAx)-0X08)/0X14)+1;  //得到通道号
    ifcr = 0x0000000f<<((channelx-1)*4);

    if(0 == DmaRecvBufLen - UartDmaRxChannel[port]->CNDTR)
    	return 0;


    RcvBufNum = pUartPollCB[port]->NowRecvbuf;


    switch (RcvBufNum)  //缓冲区切换
    {
       case 0:pUartPollCB[port]->NowRecvbuf = 1;
              break;
       case 1:pUartPollCB[port]->NowRecvbuf = 2;
              break;
       case 2:pUartPollCB[port]->NowRecvbuf = 3;
              break;
       case 3:pUartPollCB[port]->NowRecvbuf = 4;
              break;
       case 4:pUartPollCB[port]->NowRecvbuf = 0;
              break;
       default:  break;
    }

	atom_low_t atom_low = Int_LowAtomStart(); //进入原子操作状态
    DMA_Channelx->CCR&=~(1<<0);               //关闭DMA传输
    while(DMA_Channelx->CCR&0X1);             //确保DMA可以被设置
	DMAx->IFCR|=ifcr;                         //前4位置1清零，其他不变
    recvs = DmaRecvBufLen - UartDmaRxChannel[port]->CNDTR;
    DMA_Channelx->CNDTR=DmaRecvBufLen;        //DMA 数据量
    DMA_Channelx->CMAR =(u32)pUartPollCB[port]->DmaRecvBuf[pUartPollCB[port]->NowRecvbuf]; //DMA内存地址
    DMA_Channelx->CCR|= (1<<0);     //开启DMA传输
    Int_LowAtomEnd(atom_low);

    if(pUartPollCB[port]->NoCopyBufNum < 5)
    {
        pUartPollCB[port]->NoCopyBufNum++;
    }
    else
    {
        UART_ErrHandle(pUartCB[port],CN_UART_FIFO_OVER_ERR);
    }

    pUartPollCB[port]->RcvBufLen[RcvBufNum] = recvs;
    num = UART_Poll_PortWrite(pUartCB[port],recvs);
    if(num != recvs)
    {
        UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
    }
    return 0;
}
// =============================================================================
// 功能: 当uart1配置成dma方式是，dma2 ch2负责发送，ch7负责接收
// 参数: 中断函数没有参数.
// 返回: 中断函数没有返回值.
// =============================================================================
uint32_t UART_DmaRx_ISR(ptu32_t port)
{
    u32 recvs,num,DmaRecvBufLen;
    u8 *DmaRecvBuf;

    switch(port)
    {
    case CN_UART1:
        DmaRecvBufLen = UART1_DmaBufLen;        break;
    case CN_UART2:
        DmaRecvBufLen = UART2_DmaBufLen;        break;
    case CN_UART3:
        DmaRecvBufLen = UART3_DmaBufLen;        break;
    case CN_UART4:
        DmaRecvBufLen = UART4_DmaBufLen;        break;
    case CN_UART5:
        DmaRecvBufLen = UART5_DmaBufLen;        break;
    default:        break;
    }

    DmaRecvBuf = pUART_DmaRecvBuf[port];
    DMA_Disable(UartDmaRxChannel[port]);
    DMA_ClearIntFlag(UartDmaRxChannel[port]);
    recvs = DmaRecvBufLen - UartDmaRxChannel[port]->CNDTR;
    if(recvs == DmaRecvBufLen)     //dma缓冲区满，可能有数据丢失
    {
        UART_ErrHandle(pUartCB[port],CN_UART_FIFO_OVER_ERR);
    }else
    {
        num = UART_PortWrite(pUartCB[port],DmaRecvBuf,recvs,0);
        if(num != recvs)
        {
            UART_ErrHandle(pUartCB[port],CN_UART_BUF_OVER_ERR);
        }
    }

    DMA_Enable(UartDmaRxChannel[port],(u32)DmaRecvBuf,DmaRecvBufLen);
    return 0;
}

// =============================================================================
// 功能: UART的中断服务函数，包括发送空、接收、错误三种中断。
//      1.接收中断，从接收FIFO中读数据，并调用UART_PortWrite写入接收缓冲区中；
//      2.发送中断，调用UART_PortRead读发送缓冲区中数据，并写入发送FIFO；
//      3.错误中断，弹出错误事件
// 参数: 中断号.
// 返回: 0.
// =============================================================================
u32 CNT1=0,CNT2=0,CNT3=0;
u32 UART_ISR(ptu32_t port)
{
    struct UartCB *UCB;
    tagUartReg *Reg;
    u32 num;
    u8 ch;

    UCB = pUartCB[port];
    Reg = (tagUartReg *)tg_UART_Reg[port];
    if( (Reg->ISR & (1<<5)) &&(Reg->CR1 &(1<<5))) //接收中断
    {
        ch = (u8)Reg->RDR;

//        extern void ReceiveData(u8 data);
//        ReceiveData(ch);

        num = UART_PortWrite(UCB,&ch,1,0);
        if(num != 1)
        {
            UART_ErrHandle(UCB,CN_UART_BUF_OVER_ERR);
        }
    }
    if((Reg->ISR & (1<<6)) && (Reg->CR1&(1<<6)))
    {
        Reg->CR1 &=~(1<<6);//关TC中断
        Board_UartHalfDuplexRecv(port);
    }

    if((Reg->ISR & (1<<7)) && (Reg->CR1 & (1<<7))) //发送中断
    {
        num = UART_PortRead(UCB,&ch,1,0);
        if(num != 0)
            Reg->TDR = ch;
        else
        {
            Reg->CR1 &= ~(1<<7);
            Reg->CR1 |= (1<<6);
        }
    }

