china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f3xx/src/cpu_peri_uart.c
    if(Reg->ISR & (1<<3) )   //ORE过载错误
    {
        CNT3++;
        ch = (u8)Reg->RDR;
        num = Reg->ISR;      //读一下sr寄存器
        UART_ErrHandle(UCB,CN_UART_FIFO_OVER_ERR);
        Reg->ICR |=(1<<3);   //清过载标志位
    }

    if((Reg->ISR & (1<<4)) && (Reg->CR1 & (1<<4)))  //IDLE
    {

    	CNT1++;
        Reg->ICR |=(1<<4);
        if(UART_Mode[port] == CN_UART_POLL)
        {
        	UART_Poll_DmaRx_ISR(port);
        }
        else
            UART_DmaRx_ISR(port);
    }

    if(Reg->ISR & (1<<1))//帧错误直接清除暂时不做处理
    {
        CNT2++;
        Reg->ICR |=(1<<1);
    }
    return 0;
}

// =============================================================================
// 功能：初始化uart1模块,并装载串口设备，会调用uart.c的API函数。该函数主要完成的功能
//       如下：
//       1.初始化串口的硬件部分，如GPIO、中断、配置配置的COM参数，配置baud = 115200
//         stop bits = 1,无奇偶校验, data bits = 8
//       2.调用uart.c的API函数UART_InstallPort，装入串口设备
// 参数：serial_no，串口号，1~4
//       SendBufLen，若mode==CN_UART_GENERAL，则是发送环形缓冲区长度
//                   若mode==CN_UART_POLL，则是发送数据包的最大长度
//       RecvBufLen，若mode==CN_UART_GENERAL，则是接收环形缓冲区长度
//                   若mode==CN_UART_POLL，则是接收数据包的最大长度
//       mode :串口工作模式，参看CN_UART_GENERAL和CN_UART_POLL的说明
// 返回：1=成功，0=失败
// =============================================================================
ptu32_t ModuleInstall_UART(u32 serial_no,u32 SendBufLen, u32 RecvBufLen,u8 mode)
{
    struct UartParam UART_Param;
    u32 Maxbuflen = 2*MAX(SendBufLen,RecvBufLen);

    switch(serial_no)
    {
        case CN_UART1://串口1
            UART_Param.Name         = "UART1";
            if(mode == CN_UART_POLL)
                UART1_DmaBufLen     = Maxbuflen;
            break;
        case CN_UART2://串口2
            UART_Param.Name         = "UART2";
            if(mode == CN_UART_POLL)
                UART2_DmaBufLen     = Maxbuflen;
            break;
        case CN_UART3://串口3
            UART_Param.Name         = "UART3";
            if(mode == CN_UART_POLL)
                UART3_DmaBufLen     = Maxbuflen;
            break;
        case CN_UART4://串口4
            UART_Param.Name         = "UART4";
            if(mode == CN_UART_POLL)
                UART4_DmaBufLen     = Maxbuflen;
            break;
        case CN_UART5://串口5
            UART_Param.Name         = "UART5";
            if(mode == CN_UART_POLL)
                UART5_DmaBufLen     = Maxbuflen;
            break;
        default:
            return 0;
    }
    UART_Param.TxRingBufLen = SendBufLen;
    UART_Param.RxRingBufLen = RecvBufLen;
    UART_Param.mode         = mode;
    UART_Param.Baud         = 115200;
    UART_Param.UartPortTag  = (ptu32_t)tg_UART_Reg[serial_no];
    UART_Param.UartCtrl     = (UartControl)__UART_Ctrl;
    UART_Param.StartSend    = (UartStartSend)__UART_SendStart;

    UART_Mode[serial_no]       = mode;
    pUART_DmaSendBuf[serial_no]= NULL;
    pUART_DmaRecvBuf[serial_no]= NULL;
    //硬件初始化
    __UART_HardInit(serial_no);
    if(UART_Mode[serial_no] == CN_UART_POLL)
    {
    	__UART_SetDmaUsed(serial_no);   //设置DMA，将UART_Poll_DmaRx_ISR设置为实时中断，触发DMA中断
    }

    __UART_IntInit(serial_no);  //中断初始化，将UART_ISR设置成实时中断，UART_ISR中有发送、接收、IDLE、帧错误

    sUartInited |= (0x01 << serial_no);
    pUartCB[serial_no] = UART_InstallPort(&UART_Param);
    if( pUartCB[serial_no] == NULL)
        return 0;

    return 1;
}

// =============================================================================
// 功能：字符终端直接发送函数，采用轮询方式，直接写寄存器，用于printk，或者stdout
//       没有初始化
// 参数：str，发送字符串指针
//      len，发送的字节数
// 返回：0，发生错误；result,发送数据长度，字节单位
// =============================================================================
s32 Uart_PutStrDirect(const char *str,u32 len)
{
    u32 result = 0,timeout = TxByteTime * len;
    u16 CR_Bak;
    u8 port;
    for(port=0;port<CN_UART_NUM;port++)
    {
        if(PutStrDirectReg ==tg_UART_Reg[port])
            break;
    }
    Board_UartHalfDuplexSend(port);
    CR_Bak = PutStrDirectReg->CR1;  //Save INT
    PutStrDirectReg->CR1 &= ~(1<<7);   //disable send INT
    for(result=0; result < len+1; result ++)
    {
        // 超时或者发送缓冲为空时退出
        while((false == __UART_TxTranEmpty(PutStrDirectReg))&& (timeout > 10))
        {
            timeout -=10;
            Djy_DelayUs(10);
        }
        if( (timeout <= 10) || (result == len))
            break;
        PutStrDirectReg->TDR = str[result];
    }
    PutStrDirectReg->CR1 = CR_Bak;  //restore send INT
    while((PutStrDirectReg->ISR &(1<<6))!=(1<<6))
    {
        timeout -=10;
        Djy_DelayUs(10);
        if(timeout < 10)
           break;
    }
    Board_UartHalfDuplexRecv(port);
    return result;
}

// =============================================================================
// 功能：字符终端直接接收函数，采用轮询方式，直接读寄存器，用于stdin初始化前
// 参数：str，发送字符串指针
//      len，发送的字节数
// 返回：0，发生错误；result,发送数据长度，字节单位
// =============================================================================
char Uart_GetCharDirect(void)
{
    u16 CR_Bak;
    char result;

    CR_Bak = GetCharDirectReg->CR1;  //Save INT
    GetCharDirectReg->CR1 &= ~(1<<7);  //disable send INT
    while(__UART_RxHadChar(GetCharDirectReg) == false) ;
    result = GetCharDirectReg->RDR;
    PutStrDirectReg->CR1 = CR_Bak;   //restore send INT
    return result;
}

//----初始化内核级IO-----------------------------------------------------------
//功能：初始化内核级输入和输出所需的runtime函数指针。
//参数：无
//返回：无
//-----------------------------------------------------------------------------
void Stdio_KnlInOutInit(u32 para)
{
    if(!strcmp(gc_pCfgStdoutName,"/dev/UART1"))
    {
        PutStrDirectReg = (tagUartReg*)CN_UART1_BASE;
        TxDirectPort = CN_UART1;
    }
    else if(!strcmp(gc_pCfgStdoutName,"/dev/UART2"))
    {
        PutStrDirectReg = (tagUartReg*)CN_UART2_BASE;
        TxDirectPort = CN_UART2;
    }
    else if(!strcmp(gc_pCfgStdoutName,"/dev/UART3"))
    {
        PutStrDirectReg = (tagUartReg*)CN_UART3_BASE;
        TxDirectPort = CN_UART3;
    }
    else if(!strcmp(gc_pCfgStdoutName,"/dev/UART4"))
    {
        PutStrDirectReg = (tagUartReg*)CN_UART4_BASE;
        TxDirectPort = CN_UART4;
    }
    else if(!strcmp(gc_pCfgStdoutName,"/dev/UART5"))
    {
        PutStrDirectReg = (tagUartReg*)CN_UART5_BASE;
        TxDirectPort = CN_UART5;
    }
    else
    {
        PutStrDirectReg = NULL ;
    }

    if(PutStrDirectReg != NULL)
    {
        __UART_HardInit(TxDirectPort);
        TxByteTime = 95;      //初始化默认115200，发送一个byte是87uS,+10%容限
        PutStrDirect = Uart_PutStrDirect;
    }

    if(!strcmp(gc_pCfgStdinName,"/dev/UART1"))
    {
        GetCharDirectReg = (tagUartReg*)CN_UART1_BASE;
        RxDirectPort = CN_UART1;
    }
    else if(!strcmp(gc_pCfgStdinName,"/dev/UART2"))
    {
        GetCharDirectReg = (tagUartReg*)CN_UART2_BASE;
        RxDirectPort = CN_UART2;
    }
    else if(!strcmp(gc_pCfgStdinName,"/dev/UART3"))
    {
        GetCharDirectReg = (tagUartReg*)CN_UART3_BASE;
        RxDirectPort = CN_UART3;
    }
    else if(!strcmp(gc_pCfgStdinName,"/dev/UART4"))
    {
        GetCharDirectReg = (tagUartReg*)CN_UART4_BASE;
        RxDirectPort = CN_UART4;
    }
    else if(!strcmp(gc_pCfgStdinName,"/dev/UART5"))
    {
        GetCharDirectReg = (tagUartReg*)CN_UART5_BASE;
        RxDirectPort = CN_UART5;
    }
    else
    {
        GetCharDirectReg = NULL ;
    }
    if(GetCharDirectReg != NULL)
    {
        if(TxDirectPort != RxDirectPort)
            __UART_HardInit(RxDirectPort);
        GetCharDirect = Uart_GetCharDirect;
    }
    return;
}

